{
  "platforms": [
    {
      "title": "AWS",
      "image": "aws.svg",
      "description": "Among the big three clouds, there's fierce competition.  I've always leaned towards Microsoft, but IMHO at the moment AWS beats out Azure for usability, and on price too.  I've been AWS certified since Nov 2023",
      "footer": "The Best Cloud",
      "source": "https://www.credly.com/badges/396fea86-89e6-453c-9ad3-ba0389f37e84/linked_in_profile"
    },
    {
      "title": "Azure",
      "image": "microsoft-azure.svg",
      "description": "I do love Azure, there are a lot of great things going on there - I used it to backbone the mobile gaming proof-of-concept app I built in 2020 and I know my way around it pretty well.",
      "footer": "Overly Complex but Very Powerful"
    },
    {
      "title": "Android",
      "image": "android-vertical.svg",
      "description": "I've been writing Android apps since 2005.  I love it.  It's a great platform, and I've built some amazing apps with it, including the GoCar app that we got patented.  I've used Java, Kotlin and Flutter, as well as Rhomobile, to build apps on it.  The Android Development Studio Device Manager though - remains the only app I know that can reliably bring an entire Windows machine to a dead halt.  ",
      "source": "https://github.com/ivanlamont/TalkBack",
      "footer": "The #1 best mobile platform"
    },
    {
      "title": "Linux",
      "image": "linux-tux.svg",
      "description": "Alpine and Ubuntu are my go-to bases for containers these days - I run linux on the Raspberry Pi 3 also!",
      "footer": "Server Nirvana"
    }
  ],
  "frameworks": [
    {
      "title": "Tensorflow",
      "image": "tensorflow.svg",
      "description": "For machine learning, this is the best framework for me.  I know Pytorch is slightly more popular but this is what I first learned on, and I still love it.",
      "footer": "Amazing. Key."
    },
    {
      "title": "Blazor",
      "image": "blazor.png",
      "description": "This is genius. So easy to use, compiles to WASM on the browser, and they have bridged the gap between the server version and client version in the latest .NET 8.  I very highly recommend Blazor.",
      "footer": "Better than ReactJS"
    },
    {
      "title": "gRPC",
      "image": "grpc.svg",
      "description": "Using gRPC, you become aware how terribly inefficient REST is.  gRPC is twice as fast, because HTTP/2.  And PROTO files, like Swagger only better - this really is the way to connect server to client.  Anything else is silly",
      "footer": "Blisteringly fast and easy"
    },
    {
      "title": "OAuth",
      "image": "oauth.svg",
      "description": "Tokenization, SSO, scalability, interoperability, what more could you ask for - big step forward in authentication and authorization. A little tricky to implement, especially in Azure - but worth it!",
      "footer": "Very clever"
    },
    {
      "title": "EntityFramework",
      "image": "entity_framework.png",
      "description": "Wonderful technology for abstracting away the database.  I've used it for years and it's a great way to build a data layer.  I've used it with SQL Server, PostgreSQL and MySQL.  It's a great way to build a data layer, but it's not the only way.  I've also used Dapper and I'm a big fan of that too."
    },
    {
      "title": "Geneva",
      "image": "geneva.png",
      "description": "Very powerful accounting platform.  I built the first Windows UI for this at Advent in 2007, and I used it as a developer ever since.  It has terrible problems with rounding errors and the Workflow Manager needs to be monitored carefully because it can crash or hang.  But once you get to know it, you can get a ton of amazing results.",
      "footer": "Great"
    },
    {
      "title": "Flutter",
      "image": "flutter.svg",
      "description": "The story of the development of Flutter is quite amazing, and I have built cross-plaform apps using it that are breathtaking.  Now supports five native targets!  This is what React-Native should be.",
      "footer": "Amazing"
    },
    {
      "title": "Docker",
      "image": "docker.png",
      "description": "Brilliant idea, and the foundation for many other containerization technologies.  I love this, wish it had been around years ago.",
      "footer": "Beautiful"
    },
    {
      "title": "WSL2",
      "image": "wsl.png",
      "description": "The fact that Microsoft managed to make Linux run IN Windows is both amazing and hilarious.  I now do all my C++ coding inside WSL, mainly for the compiler support.  Well done MSFT",
      "footer": "It works!  Well!"
    }
  ]

}
